int/auto/OWSWSMigration/resources/dataBank/TeamEnv/Req/QueryHotelInformation_TC001.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:inf="http://webservices.micros.com/ows/5.1/Information.wsdl">
   <soapenv:Header>
      <OGHeader primaryLangID="E" timeStamp="KEYWORD_GMT_TIMESTAMP" transactionID="1100" xmlns="http://webservices.micros.com/og/4.3/Core/">
         <Origin entityID="NIRCH1" systemType="WEB"/>
         <Destination entityID="TI" systemType="ORS"/>
         <Authentication>
            <UserCredentials>
               <UserName>SUPERVISOR</UserName>
               <UserPassword>SCRUMBIZ10</UserPassword>
               <Domain>NIRMAL</Domain>
            </UserCredentials>
         </Authentication>
      </OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <inf:HotelInformationRequest>
         <inf:HotelInformationQuery chainCode="ASIA" hotelCode="NIRMAL"/>
      </inf:HotelInformationRequest>
   </soapenv:Body>
</soapenv:Envelope>